package com.ujiuye.homework4;

public class Homework01 {
/*	1. 打印99乘法表
	定义出一个方法功能, 能实现如下九九乘法表的数据打印
	1*1=1
	1*2=2	2*2=4
	1*3=3	2*3=6	3*3=9
	........................................
	1*9=9	2*9=18	3*9=27	..........	8*9=72	9*9=81
	
	*
	*       *
	*       **
	*       ***
	*       ****
	*       *****
	*       ...
	*       *********
	*   分析 :
	*    1) 九九乘法表一共需要打印9行, 设计出一个9次循环,每次循环表示每行打印
	*    2) 每一行打印的表达式规律:
	*       第一个乘数                        *      第二个乘数 = 值;
	*       从1开始到当前行数结束            就是当前打印的行数
	*       
	*       设计出一个内层循环, 用于实现多个表达式乘法运算
	*/
	public static void main(String[] args) {
         for(int i = 1; i <= 9; i++) {
        	 for(int j = 1; j <= i; j++) {
        		 System.out.print(j + "*" + i + "=" + j * i + " ");
        	 }
        	 System.out.println();
         }
	}
}
